tests/load/soak-test.yml
config:
  plugins:
    apdex: {}
  target: 'https://preprod.server.nosgestesclimat.fr'
  phases:
    - duration: 3600
      arrivalRate: 4 # environ 15 000 utilisateurs en fin de phase
      name: 'Soaking'
  processor: './generate-mock-data.ts'
scenarios:
  - name: 'Organisation participants soak test'
    flow:
      - post:
          url: '/simulations/create'
          # Récupérer situation local storage
          # Générer des computedResults différents pour chaque user
          json:
            {
              id: '{{simulationId}}',
              date: '2024-04-12T12:50:17.533Z',
              userId: '{{userId}}',
              situation: '{{situation}}',
              computedResults: '{{computedResults}}',
              foldedSteps: '{{foldedSteps}}',
              actionChoices: '{{actionChoices}}',
            }
      - think: 1
      - post:
          url: '/organisations/fetch-poll-processed-data'
          json: { orgaSlug: '', userId: '{{userId}}' }