tests/load/spike-test.yml
config:
  plugins:
    apdex: {}
  target: 'https://nosgestesclimat-preprod.osc-fr1.scalingo.io'
  phases:
    - duration: 60
      arrivalRate: 250 # 15 000 utilisateurs en fin de phase
      name: 'Spiking'
  processor: './generate-mock-data.ts'
scenarios:
  - name: 'Organisation participants spike test'
    flow:
      - post:
          url: '/simulations/create'
          json:
            {
              id: '{{simulationId}}',
              situation: {},
              foldedSteps: [],
              date: '{{date}}',
              computedResults: {},
            }
      - think: 1
      - post:
          url: '/organisations/fetch-poll-processed-data'
          json: { orgaSlug: '', userId: '{{userId}}' }