tests/load/spike-test.yml
config:
  plugins:
    apdex: {}
  target: 'https://url de de la preprod scalingo'
  phases:
    - duration: 60
      arrivalRate: 20
      name: 'Warming up'
    - duration: 240
      arrivalRate: 20
      rampTo: 100
      name: 'Ramping up'
    - duration: 500
      arrivalRate: 100
      name: 'Sustained load'
  processor: './generate-mock-data.ts'
scenarios:
  - name: 'Organisation participants spike test'
    flow:
      - post:
          url: '/simulations/create'
          json: { id: '' }
      - think: 1
      - post:
          url: '/organisations/fetch-organisation'
          json: { id: '{{id}}', date: '{{date}}' }