tests/load/spike-test.yml
config:
  plugins:
    apdex: {}
  target: 'https://preprod.server.nosgestesclimat.fr'
  phases:
    - duration: 60
      arrivalRate: 250 # 15 000 utilisateurs en fin de phase
      name: 'Spiking'
  processor: './generate-mock-data.ts'
scenarios:
  - name: 'Organisation participants spike test'
    flow:
      # Récupérer situation local storage
      # Générer des computedResults différents pour chaque user
      - post:
          url: '/simulations/create'
          json: { id: '{{simulationId}}' }
      - think: 1
      - post:
          url: '/organisations/fetch-poll-processed-data'
          json: { orgaSlug: '', userId: '{{userId}}' }